{
  "regulation": {
    "title": "Digital Assets and Service Providers Act (DASPA) 2025",
    "url": "https://example.org/law/daspa-2025"
  },
  "articles": [
    {
      "title": "1 General Provisions",
      "content": "1.1 Scope\nThis Act  to Digital Asset Service Providers (\"DASPs\") that conduct activities for or on behalf of clients within the jurisdiction, including custody, exchange, transfer, advisory, and issuance-related services.\n\n1.2 Definitions\n\"Digital Asset\" means a digitally represented value or right that can be transferred or stored using distributed ledger or similar technology, whether or not it qualifies as a financial instrument under other laws. \"Client\" means any natural or legal person receiving services from a DASP.\n\n1.3 Territorial Application\nThis Act applies to DASPs established in the jurisdiction and to foreign DASPs that actively market to, or serve, clients located in the jurisdiction.\n\n1.4 Interpretation\nIn interpreting this Act, regard shall be had to its purpose of consumer protection, market integrity, and financial stability. Terms not defined herein shall be given their ordinary meaning in regulatory practice.",
      "items": [],
      "path": []
    },
    {
      "title": "2 Authorization of Providers",
      "content": "2.1 Licensing Requirement\nNo person shall provide in-scope services unless authorized as a DASP by the Competent Authority. Authorization shall be activity-based and limited to the services specified in the authorization decision.\n\n2.2 Conditions for Authorization\nApplicants shall demonstrate: (a) fitness and propriety of controllers and key personnel; (b) adequate capitalization commensurate with scale and complexity; (c) sound governance with clear segregation of duties; (d) effective risk management, including cyber and operational risk controls; and (e) robust arrangements for safeguarding client assets.\n\n2.3 Ongoing Obligations\nAuthorized DASPs shall maintain: (1) accurate books and records; (2) effective internal controls and independent compliance; (3) incident reporting procedures; (4) policies for conflicts of interest; and (5) business continuity and disaster recovery plans.\n\n2.4 Revocation and Suspension\nThe Competent Authority may revoke or suspend authorization where the DASP: (i) breaches material provisions of this Act; (ii) no longer meets authorization conditions; (iii) provides misleading information; or (iv) fails to remedy deficiencies within the period specified by the Competent Authority.",
      "items": [],
      "path": []
    },
    {
      "title": "3 Conduct of Business and Supervision",
      "content": "3.1 Client Asset Safeguarding\nDASPs shall segregate client assets from the DASP’s own assets and hold them in trust or a functionally equivalent legal arrangement. Rehypothecation of client assets is prohibited unless expressly permitted by written client consent and applicable law.\n\n3.2 Disclosure and Transparency\nDASPs shall provide clear, fair, and not misleading information regarding risks, fees, and service conditions. Pre-contractual disclosures shall include custody arrangements, security practices, and dispute resolution options.\n\n3.3 Marketing Communications\nMarketing shall be clearly identifiable as such and shall not downplay risks inherent in digital assets or overstate potential returns. Influencer-based promotions fall within the scope of this provision.\n\n3.4 Operational Resilience\nDASPs shall implement appropriate measures to ensure continuity of critical services, including regular penetration testing, incident response runbooks, and post-incident learning reviews.\n\n3.5 Outsourcing\nMaterial outsourcing shall follow a written policy, due diligence of service providers, and contractual rights that ensure access, audit, and termination for cause. The DASP remains fully responsible for outsourced functions.\n\n3.6 Complaints Handling and Redress\nDASPs shall maintain prompt and effective complaints procedures and provide clients with access to independent alternative dispute resolution where available. Records of complaints and outcomes shall be  for no less than seven years.",
      "items": [],
      "path": []
    },
    {
      "title": "4 Enforcement, Sanctions, and Transitional Measures",
      "content": "4.1 Supervisory Powers\nThe Competent Authority may conduct on-site and off-site inspections, require information, and issue binding directions to remedy identified deficiencies.\n\n4.2 Administrative Sanctions\nWhere a breach is established, the Competent Authority may impose administrative fines, public statements, and orders to cease or desist. In setting sanctions, the Authority shall consider gravity, duration, and cooperation.\n\n4.3 Criminal Offences\nKnowingly providing in-scope services without authorization or falsifying records required under this Act constitutes a criminal offence punishable as prescribed by law.\n\n4.4 Transitional Measures\nPersons providing in-scope services on the date of entry into force shall notify the Competent Authority within 90 days and may continue operations for up to 12 months, subject to good-faith progress toward authorization.\n\n4.5 Entry into Force\nThis Act shall enter into force on 1 October 2025.",
      "items": [],
      "path": []
    }
  ]
}